Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion
Server locations that store source data.
Client can select their region to connect, the closest server the better performance.

Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion.NorthAmerica
Currently server at:
N.Virginia - United States

Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion.Europe
Currently server at:
Ireland

Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion.AsiaPacific
Currently server at:
Singapore

Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion.Australia
Currently server at:
Sydney